I believe I'm having the same issue for an interconnect attachment that was initially created in terraform with version 2.x of google provider. Below is the initial plan diff. 

As it turns out, I can't get around this without replacing the resource (which I don't want to do since it is a PARTNER connection). If I set admin_enabled to `true` or to `false`, it wants to change to the opposite.

```
  # google_compute_interconnect_attachment.default must be replaced
-/+ resource "google_compute_interconnect_attachment" "default" {
      - admin_enabled              = true -> null # forces replacement
      ~ bandwidth                  = "BPS_50M" -> (known after apply)
        candidate_subnets          = []
      ~ cloud_router_ip_address    = "XXXX" -> (known after apply)
      ~ creation_timestamp         = "2019-08-09T14:18:01.024-07:00" -> (known after apply)
      ~ customer_router_ip_address = "XXXX" -> (known after apply)
        edge_availability_domain   = "AVAILABILITY_DOMAIN_1"
      + google_reference_id        = (known after apply)
      ~ id                         = "attachment" -> (known after apply)
        name                       = "attachment"
      ~ pairing_key                = "<guid>/us-central1/1" -> (known after apply)
      ~ partner_asn                = "XXXX" -> (known after apply)
      ~ private_interconnect_info  = [] -> (known after apply)
      ~ project                    = "XXXXX" -> (known after apply)
      ~ region                     = "https://www.googleapis.com/compute/v1/projects/XXXX/regions/us-central1" -> "us-central1"
        router                     = "https://www.googleapis.com/compute/v1/projects/XXXX/regions/us-central1/routers/router"
      ~ self_link                  = "https://www.googleapis.com/compute/v1/projects/XXXX/regions/us-central1/interconnectAttachments/attachment" -> (known after apply)
      ~ state                      = "ACTIVE" -> (known after apply)
        type                       = "PARTNER"
      ~ vlan_tag8021q              = 15 -> (known after apply)
    }
```

Setting `admin_enabled = true`

```
-/+ resource "google_compute_interconnect_attachment" "default" {
      ~ admin_enabled              = false -> true # forces replacement
```

Setting `admin_enabled = false`

```
-/+ resource "google_compute_interconnect_attachment" "default" {
      ~ admin_enabled              = true -> false # forces replacement
```

Here how the terraform resource is implemented:

```hcl
resource "google_compute_interconnect_attachment" "default" {
  provider                 = google
  name                     = var.name
  router                   = var.router
  region                   = var.region
  edge_availability_domain = "AVAILABILITY_DOMAIN_1"
  type                     = "PARTNER"

  # admin_enabled            = false
  candidate_subnets        = []
}
```